{
    "1": {
        "TITLE": "Möjlig att uppfatta",
        "CONTEXT": "Information och komponenter i ett användargränssnitt måste presenteras för användare på sätt som de kan uppfatta.",
        "1": {
            "FRAGMENT": "text-alternatives",
            "TITLE": "Textalternativ",
            "CONTEXT": "Tillhandahåll alternativ i form av text till allt icke-textbaserat innehåll så att det kan konverteras till format som användarna behöver, till exempel stor stil, punktskrift, tal, symboler eller enklare språk.",
            "1": {
                "TITLE": "Innehåll som inte är text",
                "CONTEXT": "Allt innehåll som inte är text, som presenteras för användaren har ett textalternativ med samma syfte, utom i de situationer som anges nedan.",
                "CATEGORY": "A"
            }
        },
        "2": {
            "FRAGMENT": "time-based-media",
            "TITLE": "Tidsberoende media",
            "CONTEXT": "Tillhandahåll alternativ till tidsberoende media.",
            "1": {
                "TITLE": "Enbart ljud och enbart video",
                "CONTEXT": "För förinspelat ljud (enbart) och förinspelad video (enbart) gäller följande, utom när ljudet eller videon är ett mediealternativ till text och tydligt märkt som sådant:",
                "CATEGORY": "A"
            },
            "2": {
                "TITLE": "Textbeskrivningar",
                "CONTEXT": "Det finns textbeskrivningar till allt förinspelat ljud innehåll i synkroniserad media, utom när mediet är ett mediealternativ till text och tydligt är märkt som sådant.",
                "CATEGORY": "A"
            },
            "3": {
                "TITLE": "Ljudbeskrivning eller mediealternativ",
                "CONTEXT": "Det finns ett alternativ till tidsberoende media eller en ljudbeskrivning av det förinspelade video innehållet i synkroniserad media, utom när mediet är ett mediealternativ till text och tydligt är märkt som sådant.",
                "CATEGORY": "A"
            },
            "4": {
                "TITLE": "Textbeskrivningar",
                "CONTEXT": "Det finns textbeskrivningar av allt direktsänt ljudinnehåll i synkroniserad media",
                "CATEGORY": "AA"
            }
        }
    }
}